text/chart_style/c2_name_method_hello.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2019-10-09 水 14:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>チャート式Ruby class[2] variable and method</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">チャート式Ruby class[2] variable and method</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org33e62c6">1. variable</a>
<ul>
<li><a href="#org62e3ad0">1.1. お題</a></li>
<li><a href="#org4ba0268">1.2. 簡単な解説</a></li>
<li><a href="#org87f1a3d">1.3. 詳しい解法</a></li>
<li><a href="#org9b1ea04">1.4. 類題</a></li>
</ul>
</li>
<li><a href="#org256445a">2. method</a>
<ul>
<li><a href="#org9dec26f">2.1. お題</a></li>
<li><a href="#org9d535bd">2.2. 解説</a></li>
<li><a href="#org4503d5c">2.3. 解法</a></li>
<li><a href="#org9d8ccb7">2.4. 類題</a></li>
</ul>
</li>
<li><a href="#orgdb12208">3. ここで学んだこと</a></li>
<li><a href="#org23a0f7a">4. TDD</a>
<ul>
<li><a href="#org7503c62">4.1. codingの最終目標</a></li>
<li><a href="#org85bf9cd">4.2. clean code that works</a></li>
<li><a href="#org16da3f2">4.3. phases and speed</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org33e62c6" class="outline-2">
<h2 id="org33e62c6"><span class="section-number-2">1</span> variable</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org62e3ad0" class="outline-3">
<h3 id="org62e3ad0"><span class="section-number-3">1.1</span> お題</h3>
<div class="outline-text-3" id="text-1-1">
<p>
受け取った引数ARGV[0]をnameという変数(variable)に代入して
それを打ち出すcodeを書け．
</p>
<pre class="example">
&gt; ruby name_variable.rb Rudy
Rudy
</pre>
</div>
</div>

<div id="outline-container-org4ba0268" class="outline-3">
<h3 id="org4ba0268"><span class="section-number-3">1.2</span> 簡単な解説</h3>
<div class="outline-text-3" id="text-1-2">
<p>
rubyの変数は型宣言の必要性がありません．
文脈に合わせて適当に型が定められます．
イコールで代入されます．
</p>
<div class="org-src-container">
<pre class="src src-ruby">name = <span style="color: #8b2252;">'Rudy'</span>
</pre>
</div>
<p>
なんかです．
</p>
</div>
</div>

<div id="outline-container-org87f1a3d" class="outline-3">
<h3 id="org87f1a3d"><span class="section-number-3">1.3</span> 詳しい解法</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
&gt; ruby name_variable.rb Rudy
</pre>
<p>
としましょう．
</p>
<pre class="example">
ruby: No such file or directory -- name_variable.rb (LoadError)
</pre>
<p>
というエラーが返ってきますよね．そんなファイルないよって．
なら作ります．
</p>
<pre class="example">
&gt; emacs name_variable.rb
</pre>
<p>
としてemacsを起動して
</p>
<div class="org-src-container">
<pre class="src src-ruby">p <span style="color: #8b2252;">"Rudy"</span>
</pre>
</div>
<p>
と打ち込んでsaveしましょう．
</p>
<pre class="example">
&gt; ruby name_variable.rb Rudy
"Rudy"
</pre>
<p>
　
</p>
</div>
</div>
<div id="outline-container-org9b1ea04" class="outline-3">
<h3 id="org9b1ea04"><span class="section-number-3">1.4</span> 類題</h3>
<div class="outline-text-3" id="text-1-4">
<p>
さてこの後，
</p>
<ul class="org-ul">
<li>nameに代入してRudyと打ち出すようにrefactoringしてください．</li>
<li>ARGV[0]を受け取って，自分の名前を返すようにrefactoringしてください</li>
</ul>
<p>
p "Rudy"
</p>
</div>
</div>
</div>
<div id="outline-container-org256445a" class="outline-2">
<h2 id="org256445a"><span class="section-number-2">2</span> method</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9dec26f" class="outline-3">
<h3 id="org9dec26f"><span class="section-number-3">2.1</span> お題</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
&gt; ruby hello_method.rb Rudy
Hell Rudy.
</pre>
<p>
と返すhello methodを作りなさい．
</p>
</div>
</div>
<div id="outline-container-org9d535bd" class="outline-3">
<h3 id="org9d535bd"><span class="section-number-3">2.2</span> 解説</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Rubyではfunctionやprocedureなどのまとまりはmethodを定義(definition)することになります．
methodは0個以上の引数(argument)を取ることができます．
例えば次の通りです．
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">hello</span>(name)
  p name
<span style="color: #a020f0;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4503d5c" class="outline-3">
<h3 id="org4503d5c"><span class="section-number-3">2.3</span> 解法</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
&gt; ruby hello_method.rb Rudy
</pre>
<p>
として見ましょう．もちろん動きませんよね．
emacsでhello_method.rbを編集します．
</p>
<pre class="example">
&gt; emacs hello_method.rb
</pre>
<p>
何ですが，methodの中身ではなく呼び出す方から考えます．
普通に，
</p>
<div class="org-src-container">
<pre class="src src-ruby">hello(name)
</pre>
</div>
<p>
と打ち込んで動かして見てください．
</p>
<pre class="example">
&gt; ruby hello_method.rb Rudy
hello_method.rb:1:in `&lt;main&gt;': undefined local variable or method `name' for main:Object (NameError)
</pre>
<p>
というエラーが返ってきたはずです．nameという変数やmethodがundefineやと怒られています．
そこで今まで学んできたのを思い出して，
nameにARGV[0]を代入します．
</p>
<div class="org-src-container">
<pre class="src src-ruby">name = <span style="color: #228b22;">ARGV</span>[0]
hello(name)
</pre>
</div>
<p>
次のerrorは
</p>
<pre class="example">
&gt; ruby hello_method.rb Rudy
hello_method.rb:2:in `&lt;main&gt;': undefined method `hello' for main:Object (NoMethodError)
</pre>
<p>
でhelloっていうmethodがないよですね．
</p>
</div>
</div>

<div id="outline-container-org9d8ccb7" class="outline-3">
<h3 id="org9d8ccb7"><span class="section-number-3">2.4</span> 類題</h3>
<div class="outline-text-3" id="text-2-4">
<p>
先の解法を参照してhello メソッドを完成させてください．
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>hello_method.rb</label><pre class="src src-ruby">name = <span style="color: #228b22;">ARGV</span>[0]
hello(name)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdb12208" class="outline-2">
<h2 id="orgdb12208"><span class="section-number-2">3</span> ここで学んだこと</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>ruby
<ul class="org-ul">
<li>variable</li>
<li>method</li>
<li>argument</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org23a0f7a" class="outline-2">
<h2 id="org23a0f7a"><span class="section-number-2">4</span> TDD</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org7503c62" class="outline-3">
<h3 id="org7503c62"><span class="section-number-3">4.1</span> codingの最終目標</h3>
<div class="outline-text-3" id="text-4-1">
<p>
こういうcodingの仕方はTDD(Test Driven Development:テスト駆動開発)
と呼ばれています．
</p>

<ul class="org-ul">
<li>テストを作る</li>
<li>エラーを出す(red)</li>
<li>エラーをなくす(green)</li>
<li>codeを綺麗にする(refactoring)</li>
</ul>
<p>
です．codingの最終目標は
</p>
<pre class="example">
clean code that works

</pre>
<p>
動く綺麗なコードを作ることです．
順番は，まず動かして，それからこそこそと綺麗にするです．
えっと，もし，あなたが，
</p>
<ul class="org-ul">
<li>codeを書くまえに設計すべき</li>
<li>コピペは悪</li>
</ul>
<p>
なんていう，マントラを信じているなら
このprogramming styleを提唱し始めたKent Beckの文章を
載せておきます．よーーく心に刻んでください．
</p>

<p>
もしあなたがプログラミング嫌いならば，
少し心が晴れると思いますよ．俺のせいじゃないって．
</p>
</div>
</div>

<div id="outline-container-org85bf9cd" class="outline-3">
<h3 id="org85bf9cd"><span class="section-number-3">4.2</span> clean code that works</h3>
<div class="outline-text-3" id="text-4-2">
<p>
TDD by Example (Kent Beck) p.13
</p>
<blockquote>
<p>
目指すのは，動作するきれいなコードだ
(このRon Jeffriesの簡潔な表現は素晴らしい).
動作するきれいなコードは，偉大なプログラマでも
すぐには書けないことがあるし，
普通のプログラマならなおさらだ(私もそうだ)．
<code>=ここは分割統治しよう．=</code>
各個撃破だぜ，ベイビー.
最初に「動作する」に取り組み，
その後で「きれいな」に取り組む．
この方法はアーキテクチャ駆動とは正反対だ．
アーキテクチャ駆動は「きれいなコード」に最初に取り組み，
そのうえで苦心してあちこち設計の辻褄を
合わせながらどうにか「動作する」を実現させる．
</p>
</blockquote>

<p>
TDD by Example (Kent Beck) p.11
</p>
<blockquote>
<p>
The goal is clean code that works
(thenks to Ron Jeffries for this pithy summary).
Clean code that works is out of the reach of even the best programmers
some of the time,
and out of the reach of most programmers(like me)
most of the time.
Divide and conquer, baby.
First we'll solve the "that works" part of the problem.
Then we'll solve the "clean code" part.
This is the opposite of architecture-driven development,
where you solve "clean code" first,
then scramble around trying to integrate into the design the things you learn 
as you solve the "that works" problem.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org16da3f2" class="outline-3">
<h3 id="org16da3f2"><span class="section-number-3">4.3</span> phases and speed</h3>
<div class="outline-text-3" id="text-4-3">
<p>
TDD by Example (Kent Beck) p.30
</p>
<blockquote>
<p>
グリーンバーを出す小さなステップはどんなものだろうか．
Dollarクラスを丸ごとコピーして，
DollarをFrancに書き換えるのはどうだろう．
</p>

<p>
ちょっと待った．
これで唾棄すべき糞コードの出来上がりだと
あざ笑う声が聞こえる．
その声は続けて言う．
コピー&amp;ペーストによる再利用は
抽象化の敗北であり，きれいな設計を殺すと．
</p>

<p>
イラっとしただろうか．なら深呼吸だ．
鼻から息を吸い込んで，3秒止めて口から吐き出す．
オーケー？
さて，サイクルにはフェーズがあることを思い出してほしい
(中には数秒で通り過ぎるものもあるが，フェーズはフェーズだ)．
</p>
<ol class="org-ol">
<li>テストを書く．</li>
<li>コンパイラを通す．</li>
<li>テストを走らせ，失敗を確認する．</li>
<li>テストを通す．</li>
<li>重複を排除する．</li>
</ol>


<p>
各フェーズにはフェーズなりの目的と解決法があり，
価値観も異なっている．
最初の３つのフェーズはなるべく速く通過して，
新しい機能がどの状態にあるのかわかるところまで行きたい．
そこにたどり着くためには，どのような罪をおかしてもよい．
その短い時間だけは，速度が設計よりも重要だからだ．
</p>

<p>
１つ心配なのは，私がここに書いていることが，
良い設計の原則を無視してよいという免罪符になってしまうことだ．
チームに対して
「Kent Beckが設計なんてどうでもいいって書いてたよ」
などと言い始めるのは，ちょっと待ってほしい．
サイクルはまだ終わっていない．
4つ足のアーロンチェアは倒れる．
最初の4つのステップは，5つ目がなければ無意味だ．
正しい設計を，正しいタイミングで行う．
動かしてから，正しくする．
</p>

<p>
ここまで言っておけば安心だろう．
これで読者の皆さんは重複を排除するまで
誰にもコードを見せないはずだ
(ただし，ペアプロ相手は除く)
</p>
</blockquote>

<p>
TDD by Example (Kent Beck) p.23
</p>
<blockquote>
<p>
What short step will get us to a green bar?
Copying the Dollar code and replacing Dollar with Franc.
</p>

<p>
Stop.  Hold on.
I can hear the aesthetically inclined among you sneering and spitting.
Copy-and-paste reuse?
The death of abstraction?
The killer of clean design?
</p>

<p>
If you're upset, take a cleanthing breath.
In through the nose &#x2026; 
hold it 1, 2, 3&#x2026; out through the mouth.
There. Remember, our cycle has different phases
(they go by quickly, often in seconds, but they are phases.):
</p>
<ol class="org-ol">
<li>Write a test.
<ol class="org-ol">
<li>Make it compile.</li>
<li>Run it to see that it fails.</li>
</ol></li>
<li>Make it run.</li>
<li>Remove duplication.
(Make it right.)</li>
</ol>

<p>
The different phases have different purposes.
They call for different styles of solution, different aesthetic viewpoints.
The first three phases need to go by quickly,
so we get to a known state with the new functionality.
We can commit any number of sins to get there,
because speed trumps design,
just for that brief moment.
</p>

<p>
Now I'm worried.
I've given you a license to abandon all the principles of good design.
Off you go to your teams &#x2013;
"Kent says all that design stuff doesn't matter."
Halt.  The cycle is not complete.
A four-legged Aeron chair falls over.
The first four steps of the cycle won't work without the fifth.
Good design at good times.
Make it run, make it right.
</p>

<p>
There, I feel better.
Now I'm sure you won't show anyone except your partner your code
until you've removed the duplication.
Where were we?
Ah, yes.
Violating all the tenets of good design in the interest of speed
(penance for our sin will occupy the next several chapters).
</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2019-10-09 水 14:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
